# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv9c
# 618 layers, 25590912 parameters, 104.0 GFLOPs

# parameters
nc: 42  # number of classes

# gelan backbone
backbone:
  - [-1, 1, SPConv, [192]]  # 0-P1/2
  - [-1, 1, Conv, [256, 3, 2]]  # 1-P2/4
  - [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]]  # 2
  - [-1, 1, ADown, [256]]  # 3-P3/8
  - [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]]  # 4
  - [-1, 1, ADown, [512]]  # 5-P4/16
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 6
  
  #- [-1, 1, ADown, [512]]  # 7-P5/32
  #- [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 8
  - [-1, 1, SPPELAN, [512, 256]]  # 7

head:
  #- [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  #- [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 9

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 8
  - [[-1, 4], 1, Concat, [1]]  # 11  cat backbone 9
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]]  # 10 (P3/8-small)
  
#==========================
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #11 160*160*256
  - [[-1, 2], 1, Concat, [1]]  # 12   cat backbone (P2/4)
  - [-1, 1, RepNCSPELAN4, [256, 256, 256, 1]]  # 13
  
  - [-1, 1, ADown, [256]]   # 14   80*80*256
  - [[-1, 4, 10], 1, Concat, [1]]  # 15    cat head P3
  - [-1, 1, RepNCSPELAN4, [256, 512, 256, 1]]  # 16 (P3/8-)
  
#==========================
  - [-1, 1, ADown, [256]]
  - [[-1, 6, 7], 1, Concat, [1]]  #20  cat head P4
  - [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]]  # 19 (P4/16-medium)

  - [[13, 16, 19], 1, Detect, [nc]]  # Detect(p2, P3, P4)